trade_exp/src/InformationRegisters/АнкетированиеОтветы/АнкетированиеОтветы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="643577fd-9487-4e88-8c72-f629d61be78a">
  <name>АнкетированиеОтветы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="baaf8d9e-d4a6-4963-8596-754959116e3a">
    <name>Ответ</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="e256b4bd-802d-49bb-b102-a8a503cdade3">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c9b8e7ba-6e34-4fc4-ab59-9b811bce2b8e">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="450b72de-90b7-4737-bff9-c7f6bdd9000a">
    <name>ВзаимодействиеОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="4718741d-63cc-449c-a76e-28dbde8626b3">
    <name>Респондент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="de8e365b-475f-42e3-a8ba-6e024fccc41c">
    <name>ШаблонАнкеты</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a8389e52-1ac9-4fa5-b40a-4f0ef8acad3e">
    <name>Вопрос</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="95c1ddea-87da-4937-a9f2-da03fedf4b21">
    <name>НомерВарианта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="01ec4547-6443-416c-946b-51cf00035440">
    <name>ДатаЗаполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/WebServices/ОбменСБитрикс/Module.bsl
Функция PutKlient(klient)
	УстановитьПривилегированныйРежим(Истина);
	НовыйПартнер= Ложь;
	
	ДанныеКлиентаJSON= СериализаторXDTO.ПрочитатьXDTO(klient);
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеКлиентаJSON);
	СоответствиеКлиента    =  ПрочитатьJSON(ЧтениеJSON, Истина);
	
	Если СоответствиеКлиента.Количество() = 0 Тогда
		Возврат "emptyklient";
	КонецЕсли;
	ДанныеПартнера= Новый Структура;
	
	Фамилия= СоответствиеКлиента["Фамилия"];
	Имя= СоответствиеКлиента["Имя"];
	Отчество= СоответствиеКлиента["Отчество"];
	
	ДанныеПартнера.Вставить("Наименование", СокрЛП(Фамилия+" "+Имя+" "+Отчество));
	ДанныеПартнера.Вставить("Телефон", СоответствиеКлиента["Телефон"]);
	ДанныеПартнера.Вставить("Почта", СоответствиеКлиента["E-mail"]);
	ДанныеПартнера.Вставить("СогласенПолучатьПочту",  Булево(Число(СоответствиеКлиента["soglasen"])));
	ДанныеПартнера.Вставить("ДатаРождения", Дата(СоответствиеКлиента["ДатаРождения"]));
	//ДанныеПартнера.Вставить("БизнесРегион= СоответствиеКлиента["Регион"];
	ДанныеПартнера.Вставить("БизнесРегион", "Сайт");
	ДанныеПартнера.Вставить("БонуснаяПрограммаАктивна", Истина);
	ДанныеПартнера.Вставить("Комментарий", "Создан автоматически с сайта");
	ДанныеПартнера.Вставить("Б_Идентификатор", СоответствиеКлиента["Б_Идентификатор"]);
	
	Если Не ЗначениеЗаполнено(ДанныеПартнера.Телефон) Тогда
		Возврат  "emptytel";
	КонецЕсли;
	
	АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(ДанныеПартнера.Телефон);
	
	Партнер= АльтерраОбщегоНазначения.ПолучитьПартнераПоТелефону(ДанныеПартнера.Телефон);
	
	Если Не ЗначениеЗаполнено(Партнер) Тогда 
		Партнер= АльтерраОбщегоНазначения.СоздатьПартнера(ДанныеПартнера);
		НовыйПартнер= Истина;
	Иначе 
		Если АльтерраОбщегоНазначения.ЭтоЧастноеЛицо(Партнер) Или АльтерраОбщегоНазначения.ЭтоБригадир(Партнер) Тогда
			Успешно= АльтерраОбщегоНазначения.АктивироватьПартнера(Партнер);
			Если Не Успешно Тогда
				Возврат "notcreateklient";
			КонецЕсли;
		Иначе
			Возврат "notprivateclient";
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Партнер) = Тип("Строка") Тогда
		Возврат Партнер;
	КонецЕсли;
	
	ТЗ= АльтерраОбщегоНазначения.ПолучитьДанныеПартнера(Партнер.Ссылка);
	ТЗ.Колонки.Добавить("Новый");
	Если ТЗ.Количество() > 0 Тогда
		ТЗ[0].Новый= НовыйПартнер;
		стрJSON= АльтерраОбщегоНазначения.СформироватьСтрокуJSON(ТЗ);
	Иначе
		Возврат "errorgetklient";
	КонецЕсли;
	
	Возврат  стрJSON;
КонецФункции

Функция PutAnketa(tel, anketa)
	УстановитьПривилегированныйРежим(Истина);
	
	Телефон= СериализаторXDTO.ПрочитатьXDTO(tel);
	Если ПустаяСтрока(Телефон) Тогда
		Возврат "emptytel";
	КонецЕсли;
	АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(Телефон);
	
	ДанныеАнкетыJSON= СериализаторXDTO.ПрочитатьXDTO(anketa);
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеАнкетыJSON);
	СоответствиеАнкеты    =  ПрочитатьJSON(ЧтениеJSON, Истина);
	
	Если СоответствиеАнкеты.Количество() = 0 Тогда
		Возврат "emptyanketa";
	КонецЕсли;
	
	Партнер= АльтерраОбщегоНазначения.ПолучитьПартнераПоТелефону(Телефон);
	
	Если Не ЗначениеЗаполнено(Партнер) Тогда 
		Возврат "klientnotfound";
	КонецЕсли;
	
	Если Не АльтерраОбщегоНазначения.ЭтоЧастноеЛицо(Партнер) И Не АльтерраОбщегоНазначения.ЭтоБригадир(Партнер) Тогда
		Возврат "notprivateclient";
	КонецЕсли;
	
	Если АльтерраОбщегоНазначения.ЕстьАнкета50Баллов(Партнер) Тогда
		Возврат "isanketa50ballov";
	КонецЕсли;
	
	//АНКЕТА
	ШаблонАнкеты= Справочники.ШаблоныАнкетАльтерра2.НайтиПоНаименованию("Анкета 50 бонусов", Истина);
	НаборЗаписей= РегистрыСведений.АнкетированиеОтветы.СоздатьНаборЗаписей();
	Для Каждого Вопрос Из  СоответствиеАнкеты Цикл 
		Если Вопрос.Значение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Ключ= Вопрос.Ключ;
		мЗначений= Вопрос.Значение;
		спрВопрос= Справочники.ВопросыАнкетАльтерра.НайтиПоКоду(Вопрос.Ключ);
		
		НомерВарианта= 0;
		Для Каждого  Значение Из мЗначений Цикл
			Если Не ЗначениеЗаполнено(спрВопрос) ИЛИ Не ЗначениеЗаполнено(Значение) Тогда
				Продолжить;
			КонецЕсли;
			
			НаваяЗапись= НаборЗаписей.Добавить();
			НаваяЗапись.Активность= Истина;
			НаваяЗапись.Дата= ТекущаяДата();
			НаваяЗапись.ДатаЗаполнения= ТекущаяДата();
			НаваяЗапись.Респондент= Партнер;
			НаваяЗапись.ШаблонАнкеты= ШаблонАнкеты;
			НаваяЗапись.Вопрос= спрВопрос;
			НаваяЗапись.НомерВарианта= НомерВарианта;
			НаваяЗапись.Ответ= Значение;
			
			НомерВарианта= НомерВарианта+1;
		КонецЦикла;
	КонецЦикла;
	
	Если НаборЗаписей.Количество() > 0 Тогда
		Попытка
			//Регистр
			НаборЗаписей.Записать(Ложь);
			//Начислить 50 баллов
			ВидыПравилНачисленияБонусныхБаллов= Перечисления.ВидыПравилНачисленияБонусныхБаллов.Начисление;
			БонусыАльтерра.НачислитьБаллыВручную(ВидыПравилНачисленияБонусныхБаллов, Партнер, 50, "Баллы начислены");
		Исключение
			Ошибка= "notcreateanketa";
			Сообщить(Ошибка);
			ЗаписьЖурналаРегистрации("Создание анкеты с сайта", УровеньЖурналаРегистрации.Ошибка, , , Ошибка);
			Возврат Ошибка;
		КонецПопытки;
	Иначе
		Возврат "notcreateanketa";
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат  "ok";
КонецФункции
